#+BEGIN_COMMENT
.. title: On Multithreading
.. slug: on-multithreading
.. date: 2022-04-13 16:47:16 UTC+02:00
.. tags: threading, Python, java, software-engineering
.. category: 
.. link: 
.. description: 
.. type: text

#+END_COMMENT


So apparently this is a thing that I will have to master sooner or
later.

I am not a fun of it as I know it gets tricky to write solid programs
with mulit-threading when complexity increases.

For a solution that I am trying to construct I will need that bit.

This for two reasons:

1. the existing solution uses it; meaning that it is beneficial for
   you to read and understand it in order for understand the current
   design and borrow from it.

2. your new solution would either have flavours of it or use queues. I
   am rather inclined for the second but I promised to provide a
   solution for both and this is what I am currently working for.

   /Update:/ after one day I could set up a working solution with
   multithreading. Was not too difficult. But it is just at conceptual
   level. The gist of it is more less along [[https://alyssaq.github.io/2014/how-do-I-return-a-http-response-to-caller-and-continue-processing/][these]] lines.

I am not an extremely low level programmer due to my background. At
least not so far. So this is the reason I do not conceptually like the
thing and would prefer to go with a much more simple queueing
solution.

I learned in life that you should not stop in front of your conceptual
barriers. You should be aware of your gaps and taking extra care when
making a step in that direction so that you do not hurt yourself, but
by baby steps everything is possible. This is how we learn since
inception.

{{{TEASER_END}}}

*** Handling Errors

    Instead of catching an exception in a syntactic block, the
    CompletableFuture class allows us to handle it in a *special
    handle method*.

    This method receives two parameters: a /result of a computation/ (if
    it finished successfully), and the /exception thrown/ (if some
    computation step did not complete normally).

    So understand now the following two use cases. It is tricky by
    simply reading what is stated without trying that out yourself.

    So understand that there are two ways, expsed in the article. The
    first, that follows, essentially forces your to handle the error
    directly and overrride it with a default value.

    Note that an *InterrruptException* occurs when triggering the
    =CompletableFuture= so that you have to catch it.  Note that it is
    an InterruptException and not the Exception you raised in your
    lambda. 

    #+begin_src java :results output drawer :classname handle
    import java.util.concurrent.CompletableFuture;

    class handle {

	public static void main(String args[]){

	    String name = null;

	    // ...

	    CompletableFuture<String> completableFuture  
		=  CompletableFuture.supplyAsync(() -> {

			if (name == null) {
			    throw new RuntimeException("Computation error!");
			}

			return "Hello, " + name;

		    }).handle((s, t) -> s != null ? s : "RuntimeException");

	    try {
		System.out.println(completableFuture.get());
	    }

	    catch (Exception e) {

		// Note you have to catch the exception but this chunck is
		// never executed.

		System.out.println("Here");

	    }
	} 

    }
    #+end_src

    #+RESULTS:
    :results:
    RuntimeException
    :end:

    The second possibility is the one of actually raising the
    Error. This is the one you are more interested in as it will make
    it more easy to debug your programs.

    I.e. here you want the /Future/ to have the possibility to
    complete with an exception.

    You can achieve this by the following schema.

    #+begin_src java :results output drawer :classname handle
    import java.util.concurrent.CompletableFuture;

    class handle {

	public static void main(String args[]){

	    try{
		CompletableFuture<String> completableFuture   = new CompletableFuture<>();

		completableFuture.completeExceptionally(new RuntimeException("Calculation failed!"));

		completableFuture.get();
	    } catch (Exception e) {
		System.out.println(e.getMessage());
	    }

	} 

    }
    #+end_src

    #+RESULTS:
    :results:
    java.lang.RuntimeException: Calculation failed!
    :end:

    
**** 101 Example - the only issue is that it is blocking

     Understand the example below. You do not run the task on the main
     thread. The program running on the main thread ends before the
     task on the other thread finishes. This is the reason why you do
     not see the results.
     
     #+begin_src java :results output drawer :classname handle
     import java.util.concurrent.CompletableFuture;
     import java.util.concurrent.TimeUnit;

     class handle {

	 static CompletableFuture<Void> task = new CompletableFuture();

	 private static void longRun() {

	     try{

		 TimeUnit.SECONDS.sleep(3);
		 System.out.println("Hello World");

	     }
	     catch (InterruptedException e) {

		 throw new IllegalStateException(e);

	     }

	 };

	 public static void main(String args[]){

	     System.out.println("Greetings, program started.");

	     CompletableFuture<Void> future = CompletableFuture.runAsync(() -> {
		     // Simulate a long-running Job   
		     try{

			 System.out.println("Before triggering future");

			 task.complete(null);

			 System.out.println("Finished Processing");

		     }
		     catch(Exception e) {

			 System.out.println("Exception Occurred");

		     };
		 });

	     try{
		 future.get();
	     } catch (Exception e) {
		 System.out.println("Exception Occurred");

	     }

	     task.thenAcceptAsync(result->{
		     System.out.println("Triggering Task");
		     longRun();
		     System.out.println(task.isDone());
		 }).exceptionally(e->{
			 System.out.println("Some error");
			 return null;
		     });

	 }

     }
     #+end_src

     #+RESULTS:
     :results:
     Greetings, program started.
     Before triggering future
     Finished Processing
     Triggering Task
     :end:


**** 101 Example - Continued

     See that if you do not run on a separate thread but rather on the
     main one, the entire code executes and you see the results accordingly.
          
     #+begin_src java :results output drawer :classname handle
     import java.util.concurrent.CompletableFuture;
     import java.util.concurrent.TimeUnit;

     class handle {

	 static CompletableFuture<Void> task = new CompletableFuture();

	 private static void longRun() {

	     try{

		 TimeUnit.SECONDS.sleep(3);
		 System.out.println("Hello World");

	     }
	     catch (InterruptedException e) {

		 throw new IllegalStateException(e);

	     }

	 };

	 public static void main(String args[]){

	     System.out.println("Greetings, program started.");

	     CompletableFuture<Void> future = CompletableFuture.runAsync(() -> {
		     // Simulate a long-running Job   
		     try{

			 System.out.println("Before triggering future");

			 task.complete(null);

			 System.out.println("Finished Processing");

		     }
		     catch(Exception e) {

			 System.out.println("Exception Occurred");

		     };
		 });

	     try{
		 future.get();
	     } catch (Exception e) {
		 System.out.println("Exception Occurred");
	     }

	     task.thenAccept(result->{
		     System.out.println("Triggering Task");
		     longRun();
		     System.out.println(task.isDone());
		 }).exceptionally(e->{
			 System.out.println("Some error");
			 return null;
		     });

	 }

     }
     #+end_src

     #+RESULTS:
     :results:
     Greetings, program started.
     Before triggering future
     Finished Processing
     Triggering Task
     Hello World
     true
     :end:


**** 101 Simplified - here is the real key.

     Note that all of the above is correct. It is a bit cumbersome
     cause you did not understand the thing at 100%.

     By now everything is clear and you can see below a very good
     example of it.

     So you see sometimes the experimental way of doing the things is
     the only possibility.
          
     #+begin_src java :results output drawer :classname handle
     import java.util.concurrent.CompletableFuture;
     import java.util.concurrent.TimeUnit;

     class handle {

	 static CompletableFuture<Void> task = new CompletableFuture();

	 private static void longRun() {

	     try{

		 TimeUnit.SECONDS.sleep(3);

	     }
	     catch (InterruptedException e) {

		 throw new IllegalStateException(e);

	     }

	 };

	 public static void main(String args[]){

	     System.out.println("Greetings, program started.");

	     task.runAsync(()->{

		     System.out.println("Triggering Task");
		     longRun();
		     task.complete(null);
		     System.out.println("The task is done: " + task.isDone());

		 }).exceptionally(e->{

			 System.out.println("Some error");
			 return null;

		     });

	     // Set here a loop checking if the job finished
	     while(!task.isDone()){

		 System.out.println("Task Unfinished");

		 try{

		     TimeUnit.SECONDS.sleep(1);

		 }
		 catch (InterruptedException e) {

		     throw new IllegalStateException(e);

		 }

	     };

	     System.out.println("Finished Program.");
	 }

     }
     #+end_src

     #+RESULTS:
     :results:
     Greetings, program started.
     Triggering Task
     Task Unfinished
     Task Unfinished
     Task Unfinished
     Task Unfinished
     Hello World
     The task is done: true
     Finished Program.
     :end:
     
     
**** Very Simple Example to Show Ansynchronicity

     The above example was based on the following resource found on
     the internet. Essentially you can see here the idea of combining
     the different CompletableFutures together. 

     #+begin_src java :results output drawer :classname handle
     import java.util.concurrent.CompletableFuture;

     class handle {

	 public static void main (String[] args) throws java.lang.Exception
	 {
	     CompletableFuture<Void> s = new CompletableFuture();
	     CompletableFuture<Void> f = new CompletableFuture();

	     CompletableFuture<Void> someContext =  CompletableFuture.supplyAsync(() ->{

		     System.out.println("This thread ID is: " + Thread.currentThread().getId());

		     CompletableFuture<String> update =
			 CompletableFuture.supplyAsync(
						       () -> {

							   String ans = null;

							   try {

							       System.out.println("The thread ID is: " + Thread.currentThread().getId());
							       ans = "Hello";

							   } catch (Exception e) {

							       ans = e.toString();

							   } finally {

							       s.complete(null); // completing s future. 
							       return ans;

							   }
						       });

		     // After s is complete
		     s.thenAcceptAsync(result->{
			     System.out.println(s.isDone());
			 }).exceptionally(e->{
				 System.out.println("Some error");
				 return null;
			     });

		     return null;
		 });

	     someContext.get();

	 }
     }

     #+end_src

     #+RESULTS:
     :results:
     This thread ID is: 13
     The thread ID is: 14
     true
     :end:

     
**** Same stuff using Functional Interface

     You can implement similar logic in your backend when you want to
     implement some particular asynchronous pattern. 
    
     #+begin_src java :results output drawer :classname handle
     import java.util.concurrent.CompletableFuture;
     import java.util.HashMap;
     import java.util.concurrent.TimeUnit;

     import java.time.format.DateTimeFormatter;  
     import java.time.LocalDateTime;    

     class handle {

	 private static String string1 = "blah";
	 private static String string2 = "baubab";
	 private static String string3 = "stars";

	 @FunctionalInterface
	 interface FunctionalFour<One, Two, Three, Four, Five> {

	     public Five apply(One one, Two two, Three three, Four four);

	 };

	 private static FunctionalFour<String, String, String, Integer, Void> LongRunningAsync = (string1, string2,
												  string3, int1) -> {

	     DateTimeFormatter dtf = DateTimeFormatter.ofPattern("yyyy/MM/dd HH:mm:ss");  
	     Integer x = int1;
	     x = x + 10;

	     try {
		 LocalDateTime now = LocalDateTime.now();  
		 System.out.println("Starting Long Running Task: " + dtf.format(now));
		 TimeUnit.SECONDS.sleep(4);
		 now = LocalDateTime.now();  
		 System.out.println("Finished Long Running Task: " + dtf.format(now));

	     } catch (Exception e) {

		 System.out.println("Thread suspended");

	     };

	     return null;

	 };

	 public static void main(String args[]){

	     System.out.println("Greetings, program started.");

	     CompletableFuture<Void> jobTrigger = new CompletableFuture();

	     CompletableFuture<Void> future
		 = CompletableFuture.runAsync(() -> { 

			 jobTrigger.complete(null);

			 HashMap<String, Object> map = new HashMap<String, Object>();

			 map.put("Response", "Started Processing the LongRunning job. " + string1 + " " + string2 + " " + string3 + ".");

			 map.entrySet().forEach(entry -> {
				 System.out.println(entry.getKey() + ": " + entry.getValue());
			     });

		     });


	     try{

		 future.get();

	     } catch(Exception e) {
		 System.out.println("Exception Occurred");
	     }

	     // Run with thenAcceptAsync if you do not want to see the results.
	     jobTrigger.thenAccept(result -> {

		     LongRunningAsync.apply(string1, string2, string3, 4);

		 }).exceptionally(e->{
			 System.out.println("Some error");
			 return null;
		     });

	 }

     }
     #+end_src

     #+RESULTS:
     :results:
     Greetings, program started.
     Response: Started Processing the LongRunning job. blah baubab stars.
     Starting Long Running Task: 2022/10/17 15:59:21
     Finished Long Running Task: 2022/10/17 15:59:21
     :end:


